       IDENTIFICATION DIVISION.
       PROGRAM-ID. G-A-PROV.
       REMARKS. GENERA ARCHIVO RELATIVO DE PROVINCIAS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *
      * DECLARACION DEL ARCHIVO DE PROVINCIAS
      *
           SELECT A-PROVIN ASSIGN TO DISK 'PROVINCIAS.DAT'
                  ORGANIZATION RELATIVE
                  ACCESS RANDOM
                  RELATIVE KEY DIR-RELATIVA.

       DATA DIVISION.
       FILE SECTION.

      *
      * DESCRIPCION DEL REGISTRO DEL ARCHIVO RELATIVO DE PROVINCIAS
      *
       FD A-PROVIN
           LABEL RECORD STANDARD.
       01 CODPRO         PIC 9(2).
       01 DESPRO         PIC X(25).

       WORKING-STORAGE SECTION.
       77 DIR-RELATIVA      PIC 9(4).

       PROCEDURE DIVISION.
       GENERA-ARCHIVO-PROVINCIAS.

      *
      * GENERA ARCHIVO DE PROVINCIAS CON EL NOMBRE 'PROVINCIAS.DAT'
      *

           OPEN OUTPUT A-PROVIN.
           CLOSE A-PROVIN.

           STOP RUN.
