       IDENTIFICATION DIVISION.
       PROGRAM-ID. G-A-MOVI.
       REMARKS. GENERA ARCHIVO SEQUENCIAL MOVIMIENTOS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *
      * DECLARACION DEL ARCHIVO DE MOVIMIENTOS
      *
           SELECT A-SUCURS ASSIGN TO DISK 'SUCURSAL.DAT'
                  ORGANIZATION LINE SEQUENTIAL
                  ACCESS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

      *
      * DESCRIPCION DEL REGISTRO DEL ARCHIVO SEQUENCIAL DE MOVIMIENTOS
      *
       FD A-SUCURS
           LABEL RECORD STANDARD.
       01 TIPMOV         PIC X(1).
       01 CLIMOV         PIC X(5).
       01 NOMMOV         PIC X(25).
       01 IMPMOV         PIC 9(5)V9(2).

      * WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       GENERA-ARCHIVO-MOVIMIENTOS.

      *
      * GENERA ARCHIVO DE MOVIMIENTOS CON EL NOMBRE 'SUCURSAL.DAT'
      *

           OPEN OUTPUT A-SUCURS.
           CLOSE A-SUCURS.

           STOP RUN.
