      *
	  * PROGRAMA QUE LEE EN SECUENCIA LOS REGISTROS
	  * DEL ARCHIVO SECUENCIAL DE ARTICULOS.
	  *

123456 IDENTIFICATION DIVISION
       PROGRAM-ID. PE-ASI03.
	   REMARKS. ARCHIVOS / FICHEROS SECUENCIALES INDEXADOS.
	   
	   ENVIRONMENT DIVISION
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
		   
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
      *
	  * DECLARACION DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
           SELECT A-ARTICULO ASSIGN TO DISK 'AARTI.IND'
		          ORGANIZATION INDEXED
				  ACCESS SEQUENTIAL
				  RECORD KEY COD-ARTI
				  ALTERNATE RECORD KEY COD-TPARTI DUPLICATES.
				  
	   DATA DIVISION.
	   FILE SECTION.
	  *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
	   FD  A-ARTICULO
	       LABEL RECORD STANDARD.
	   01  R-ARTICULO.
	       02 COD-ARTI     PIC 9(4).
		   02 NOM-ARTI     PIC X(25).
		   02 NUM-ARTI     PIC 9(6).
		   02 PRE-ARTI     PIC 9(4)V9(2).
		   02 COD-TPARTI   PIC X(3).

       WORKING-STORAGE SECTION.
	   77  FIN-ARTICULO    PIC X.
	   
	   PROCEDURE DIVISION.
	   INICIO-PROGRAMA.
	  *
	  * BLOQUE PRINCIPAL DEL PROGRAMA
	  *
           PERFORM LISTAR-ARTICULOS.
		   STOP RUN.
	  *
	  * LEER EN SECUENCIA EL ARCHIVO DE ARTICULOS Y MOSTRALO POR PANTALLA
	  *
	   LISTAR-ARTICULOS.
	       DISPLAY SPACE LINE 20 ERASE.
		   DISPLAY 'ARCHIVO DE ARTICULOS'.
		   DISPLAY '--------------------'.
		   
		   OPEN INPUT A-ARTICULO.
		   
		   MOVE 'N' TO FIN-ARTICULO
		   READ A-ARTICULO AT END MOVE 'S' TO FIN-ARTICULO
		   END-READ.
		   
		   PERFORM UNTIL FIN-ARTICULO = 'S'
		      DISPLAY COD-ARTI '-' NOM-ARTI '-' NUM-ARTI '-'
			          PRE-ARTI '-' COD-TPARTI
					  
			  READ A-ARTICULO AT END MOVE 'S' TO FIN-ARTICULO
			  END-READ
		   END-PERFORM.
		   
		   CLOSE A-ARTICULO.
		   
		   DISPLAY '----FIN LISTADO-----'.
		   DISPLAY SPACE.
