      *
	  * PROGRAMA QUE OBTIENE LOS VALORES MAXIMO Y MINIMO PARA
	  * UNA CLAVE EXISTENTE EN EL ARCHIVO SECUENCIAL INDEXADO
	  * DE ARTICULOS.
	  * 

123456 IDENTIFICATION DIVISION
       PROGRAM-ID. PE-ASI09.
	   REMARKS. ARCHIVOS / FICHEROS SECUENCIALES INDEXADOS.
	   
	   ENVIRONMENT DIVISION
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
		   
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
      *
	  * DECLARACION DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
           SELECT A-ARTICULO ASSIGN TO DISK 'AARTIXX.IND'
		          ORGANIZATION INDEXED
				  ACCESS SEQUENTIAL
				  RECORD KEY CLA-ARTI.
				  
	   DATA DIVISION.
	   FILE SECTION.
	  *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
	   FD  A-ARTICULO
	       LABEL RECORD STANDARD.
	   01  R-ARTICULO.
	       02 CLA-ARTI.
		      03 COD-TPARTI  PIC X(3).
			  03 COD-ARTI    PIC 9(4).
		   02 NOM-ARTI       PIC X(25).
		   02 NUM-ARTI       PIC 9(6).
		   02 PRE-ARTI       PIC 9(4)V9(2).
		   
       WORKING-STORAGE SECTION.
	   77  COD-TPARTI-P      PIC X(3).
	   77  FIN-ARTICULO      PIC X.
	   
	   PROCEDURE DIVISION.
	   INICIO-PROGRAMA.
	  *
	  * BLOQUE PRINCIPAL DEL PROGRAMA
	  *
	       DISPLAY SPACE LINE 20 ERASE.
		   OPEN INPUT A-ARTICULO.
		   
		   PERFORM SOLICITAR-TIPOARTICULO.
		   PERFORM CLAVE-MINIMA-ARCHIVO.
		   PERFORM CLAVE-MAXIMA-ARCHIVO.
		   PERFORM CLAVE-MINIMA-TIPOARTICULO.
		   PERFORM CLAVE-MAXIMA-TIPOARTICULO.
		   
		   CLOSE A-ARTICULO.
		   STOP RUN.
	  *
	  * SOLICITA EL TIPO DE ARTICULO POR PANTALLA
	  *
	   SOLICITAR-TIPOARTICULO.
	       DISPLAY 'INTRODUCE TIPO DE ARTICULO:'
		   ACCEPT COD-TPARTI-P NO BEEP.
		   DISPLAY SPACE.
	  *
	  * OBTENER LA CLAVE MINIMA DEL ARCHIVO
	  *
	   CLAVE-MINIMA-ARCHIVO.
	       READ A-ARTICULO
		     AT END
			    DISPLAY 'ARCHIVO VACIO'
			 NOT AT END
			    DISPLAY 'CLAVE MINIMA ARCHIVO: ' COD-TPARTI '-' COD-ARTI
		   END-READ.
	  *
	  * OBTENER LA CLAVE MAXIMA DEL ARCHIVO
	  *
	   CLAVE-MAXIMA-ARCHIVO.
	       MOVE HIGH-VALUES TO CLA-ARTI.
		   
		   START A-ARTICULO KEY <= CLA-ARTI
		     INVALID
			   DISPLAY 'NO EXISTE REGISTRO CON ESA CONDICION'
			 NOT INVALID
			   READ A-ARTICULO
			   DISPLAY 'CLAVE MAXIMA ARCHIVO: ' COD-TPARTI '-' COD-ARTI
		   END-START.
	  *
	  * OBTENER LA CLAVE MINIMA PARA UN TIPO DE ARCHIVO
	  *
	   CLAVE-MINIMA-ARCHIVO.
	       MOVE COD-TPARTI-P TO COD-TPARTI.
		   MOVE 0            TO COD-ARTI.
		   		   
		   START A-ARTICULO KEY >= CLA-ARTI
		     INVALID
			   DISPLAY 'NO EXISTE REGISTRO CON ESA CONDICION'
			 NOT INVALID
			   READ A-ARTICULO
			   IF COD-TPARTI-P NOT = COD-TPARTI
			      DISPLAY 'NO EXISTE TIPO DE ARTICULO:' COD-TPARTI-P
			   ELSE
			      DISPLAY 'CLAVE MINIMA TIPO: ' COD-TPARTI '-' COD-ARTI
			   END-IF
		   END-START.
	  *
	  * OBTENER LA CLAVE MAXIMA PARA UN TIPO DE ARCHIVO
	  *
	   CLAVE-MAXIMA-TIPOARTICULO.
	       MOVE COD-TPARTI-P TO COD-TPARTI.
		   MOVE 9999         TO COD-ARTI.
		   
		   START A-ARTICULO KEY <= CLA-ARTI
		     INVALID
			   DISPLAY 'NO EXISTE REGISTRO CON ESA CONDICION'
			 NOT INVALID
			   READ A-ARTICULO
			   IF COD-TPARTI-P NOT = COD-TPARTI
			      DISPLAY 'NO EXISTE TIPO DE ARTICULO:' COD-TPARTI-P
			   ELSE
			      DISPLAY 'CLAVE MAXIMA TIPO: ' COD-TPARTI '-' COD-ARTI
			   END-IF
		   END-START.