      *
	  * EL ARCHIVO ALMACENADO EN DISCO CON EL NOMBRE
	  * 'AARTI.IND' ES UN ARCHIVO SECUENCIAL INDEXADO.
	  * SU CLAVE PRIMARIA = COD-ARTI
	  * CLAVE SECUNDARIA COD-TPARTI (ACEPTA DUPLICADOS)
	  * SERA ACEDIDO DE FORMA ALEATORIA
	  *
	  * PROGRAMA QUE CREA UN ARCHIVO SECUENCIAL INDEXADO
	  * DE ARTICULOS A PARTIR DEL ARCHIVO SECUENCIAL DE
	  * ARTICULOS
	  *

123456 IDENTIFICATION DIVISION
       PROGRAM-ID. PE-ASI01.
	   REMARKS. ARCHIVOS / FICHEROS SECUENCIALES INDEXADOS.
	   
	   ENVIRONMENT DIVISION
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
		   
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
      *
	  * DECLARACION DEL ARCHIVO SECUENCIAL DE ARTICULOS
	  *
           SELECT A-ARTICULO-S ASSIGN TO DISK 'AARTI.SEC'
		          ORGANIZATION LINE SEQUENTIAL
				  ACCESS SEQUENTIAL.
      *
	  * DECLARACION DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
           SELECT A-ARTICULO-I ASSIGN TO DISK 'AARTI.IND'
		          ORGANIZATION INDEXED
				  ACCESS RANDOM
				  RECORD KEY COD-ARTI-I
				  ALTERNATE RECORD KEY COD-TPARTI-I DUPLICATES.
				  
	   DATA DIVISION.
	   FILE SECTION.
	  *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO SECUENCIAL DE ARTICULOS
	  *
	   FD  A-ARTICULO-S
	       LABEL RECORD STANDARD.
	   01  R-ARTICULO-S.
	       02 COD-ARTI-S     PIC 9(4).
		   02 NOM-ARTI-S     PIC X(25).
		   02 NUM-ARTI-S     PIC 9(6).
		   02 PRE-ARTI-S     PIC 9(4)V9(2).
		   02 COD-TPARTI-S   PIC X(3).
	  *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
	   FD  A-ARTICULO-I
	       LABEL RECORD STANDARD.
	   01  R-ARTICULO-I.
	       02 COD-ARTI-I     PIC 9(4).
		   02 NOM-ARTI-I     PIC X(25).
		   02 NUM-ARTI-I     PIC 9(6).
		   02 PRE-ARTI-I     PIC 9(4)V9(2).
		   02 COD-TPARTI-I   PIC X(3).

       WORKING-STORAGE SECTION.
	   77  FIN-ARTICULO-S    PIC X.
	   
	   PROCEDURE DIVISION.
	   INICIO-PROGRAMA.
	  *
	  * LEER REGISTROS DEL ARCHIVO SECUENCIAL DE ARTICULOS
	  * Y GRABAR EN EL ARCHIVO SECUENCIAL INDEXADO DE ARTICULOS
	  *
	   OPEN INPUT  A-ARTICULO-S.
	   OPEN OUTPUT A-ARTICULO-I.
	   
	   MOVE 'N' TO FIN-ARTICULO-S
	   READ A-ARTICULO-S AT END MOVE 'S' TO FIN-ARTICULO-S
	   END-READ.
	   
	   PERFORM UNTIL FIN-ARTICULO-S = 'S'
	      MOVE R-ARTICULO-S TO R-ARTICULO-I
		  WRITE R-ARTICULO-I
		  READ A-ARTICULO-S AT END MOVE 'S' TO FIN-ARTICULO-S
		  END-READ
	   END-PERFORM.
	   
	   CLOSE A-ARTICULO-S.
	   CLOSE A-ARTICULO-I.
	   
	   STOP RUN.
  