      *
	  * PROGRAMA QUE LEE EN SECUENCIA LOS REGISTROS
	  * DEL ARCHIVO SECUENCIAL INDEXADO DE ARTICULOS Y
	  * CON CODIGO DEL TIPO DE ARTICULOS ACCEDE AL ARCHIVO
	  * SECUENCIAL INDEXADO DE TIPOS DE ARTICULOS PARA
	  * SACAR SU DESCRIPCION.
	  *

123456 IDENTIFICATION DIVISION
       PROGRAM-ID. PE-ASI04.
	   REMARKS. ARCHIVOS / FICHEROS SECUENCIALES INDEXADOS.
	   
	   ENVIRONMENT DIVISION
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
		   
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
      *
	  * DECLARACION DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
           SELECT A-ARTICULO ASSIGN TO DISK 'AARTI.IND'
		          ORGANIZATION INDEXED
				  ACCESS SEQUENTIAL
				  RECORD KEY COD-ARTI
				  ALTERNATE RECORD KEY COD-TPARTI DUPLICATES.
      *
	  * DECLARACION DEL ARCHIVO INDEXADO DE TIPOS DE ARTICULOS
	  *
           SELECT A-TIPOARTI ASSIGN TO DISK 'ATPAR.IND'
		          ORGANIZATION INDEXED
				  ACCESS RANDOM
				  RECORD KEY COD-ARTI.
				  
	   DATA DIVISION.
	   FILE SECTION.
	  *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO INDEXADO DE ARTICULOS
	  *
	   FD  A-ARTICULO
	       LABEL RECORD STANDARD.
	   01  R-ARTICULO.
	       02 COD-ARTI     PIC 9(4).
		   02 NOM-ARTI     PIC X(25).
		   02 NUM-ARTI     PIC 9(6).
		   02 PRE-ARTI     PIC 9(4)V9(2).
		   02 COD-TPARTI   PIC X(3).
	  *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO INDEXADO DE TIPO ARTICULOS
	  *
	   FD  A-TIPOARTI
	       LABEL RECORD STANDARD.
	   01  R-TIPOARTI.
		   02 COD-TPARTI   PIC X(3).
		   02 DES-TPARTI   PIC X(20).

       WORKING-STORAGE SECTION.
	   77  FIN-ARTICULO    PIC X.
	   77  LL-TPARTI       PIC X(6).
	   
	   PROCEDURE DIVISION.
	   INICIO-PROGRAMA.
	  *
	  * LEER REGISTROS DEL ARCHIVO SECUENCIAL DE ARTICULOS
	  * Y GRABAR EN EL ARCHIVO SECUENCIAL INDEXADO DE ARTICULOS
	  *
           OPEN INPUT A-ARTICULO.
		   OPEN INPUT A-TIPOARTI.
		   
		   MOVE 'N' TO FIN-ARTICULO
		   READ A-ARTICULO AT END MOVE 'S' TO FIN-ARTICULO
		   END-READ.
		   
		   PERFORM UNTIL FIN-ARTICULO = 'S'
		      MOVE COD-TPARTI OF R-ARTICULO TO COD-TPARTI OF TIPOARTI
			  READ A-TIPOARTI KEY COD-TPARTI OF R-TIPOARTI
			       INVALID
				      MOVE ALL 'X'       TO DES-TPARTI
					  MOVE 'ERROR'       TO LEE-TPARTI
				   NOT INVALID
				      MOVE 'OK   '       TO LEE-TPARTI
			  END-READ
			  DISPLAY COD-ARTI '-' NOM-ARTI '-' NUM-ARTI '-'
			          PRE-ARTI '-' COD-TPARTI OF R-ARTICULO ' ** '
					  LEE-TPARTI '-' DES-TPARTI
			  READ A-ARTICULO AT END MOVE 'S' TO FIN-ARTICULO
              END-READ
           END-PERFORM.

           CLOSE A-ARTICULO.
           CLOSE A-TIPOARTI.

           STOP RUN.