      *
      * PROGRAMA QUE CREA UN ARCHIVO RELATIVO DE ARTICULOS
      * A PARTIR DEL ARCHIVO SECUENCIAL DE ARTICULOS
      *

123456 IDENTIFICATION DIVISION. 
       PROGRAM-ID. PE-AR01.
       REMARKS. ARCHIVOS/FICHEROS RELATIVOS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	  *
	  * DECLARACION DEL ARCHIVO SECUENCIAL DE ARTICULOS
	  *
            SELECT A-ARTICULO-S ASSIGN TO DISK 'AARTI.SEC' 
                   ORGANIZATION LINE SEQUENTIAL
                   ACCESS SEQUENTIAL.
	  *
	  * DECLARACION DEL ARCHIVO RELATIVO DE ARTICULOS
	  *
            SELECT A-ARTICULO-R ASSIGN TO DISK 'AARTI.REL' 
                   ORGANIZATION RELATIVE
                   ACCESS RANDOM
				   RELATIVE KEY DIR-RELATIVA.

	   DATA DIVISION.
       FILE SECTION.
      *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO SECUENCIAL DE ARTICULOS
	  *
       FD A-ARTICULO-S 
	      LABEL RECORD IS STANDARD.
       01 R-ARTICULO-S.
          02 COD-ARTI-S     PIC 9(4).
          02 NOM-ARTI-S     PIC X(25).
		  02 NUM-ARTI-S     PIC 9(6).
		  02 PRE-ARTI-S     PIC 9(4)V9(2).
		  02 COD-TPARTI-S   PIC X(3).
      *
	  * DESCRIPCION DEL REGISTRO DEL ARCHIVO RELATIVO DE ARTICULOS
	  *
       FD A-ARTICULO-R 
	      LABEL RECORD IS STANDARD.
       01 R-ARTICULO-R.
          02 COD-ARTI-R     PIC 9(4).
          02 NOM-ARTI-R     PIC X(25).
		  02 NUM-ARTI-R     PIC 9(6).
		  02 PRE-ARTI-R     PIC 9(4)V9(2).
		  02 COD-TPARTI-R   PIC X(3).

       WORKING-STORAGE SECTION.
       77 FIN-ARTICULO-S    PIC X.
       77 DIR-RELATIVA      PIC 9(4).

       PROCEDURE DIVISION.
       INICIO-PROGRAMA.
      *
	  * LEER REGISTROS DEL ARCHIVO SECUENCIAL DE ARTICULOS
	  * Y GRABAR EN EL ARCHIVO RELATIVO
	  *
           OPEN INPUT  A-ARTICULO-S.
           OPEN OUTPUT A-ARTICULO-R.
           MOVE 'N'   TO   FIN-ARTICULO-S
		   READ A-ARTICULO-S AT END MOVE 'S' TO FIN-ARTICULO-S
		   END-READ.
			  
		   PERFORM UNTIL FIN-ARTICULO-S = 'S'
			  MOVE R-ARTICULO-S   TO R-ARTICULO-R
			  MOVE COD-ARTI-S     TO DIR-RELATIVA
		      WRITE R-ARTICULO-R
			  READ A-ARTICULO-S AT END MOVE 'S' TO FIN-ARTICULO-S
			  END READ
		   END-PERFORM.
			  
		   CLOSE A-ARTICULO-S.
		   CLOSE A-ARTICULO-R.
			  
		   STOP RUN.