      *
	  * PROGRAMA QUE CREA UN ARCHIVO SECUENCIAL DE
	  * CLIENTES Y UN ARCHIVO SECUENCIAL INDEXADO
	  * DE FACTURAS
	  *

123456 IDENTIFICATION DIVISION
       PROGRAM-ID. PE-ASI10.
	   REMARKS. DECLARACION DE ARCHIVOS
	   
	   ENVIRONMENT DIVISION
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
		   
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	  *
	  * DECLARACION DEL ARCHIVO SECUENCIAL DE CLIENTES
	  *
	       SELECT AR-CLIENTE ASSIGN TO DISK 'ACLIENTE.DAT'
		          ORGANIZATION SEQUENTIAL
				  ACCESS SEQUENTIAL.
				  
	  *
	  * DECLARACION DEL ARCHIVO INDEXADO DE FACTURAS
	  *
	       SELECT AR-FACTURA ASSIGN TO DISK 'AFACTURA.DAT'
		          ORGANIZATION INDEXED
				  ACCESS DYNAMIC
				  RECORD KEY COD-FACTU
				  ALTERNATE RECORD KEY COD-CLI DUPLICATES.
				  
	   DATA DIVISION.
	   FILE SECTION.
	  *
	  * DESCRIPCION DEL REGISTRO DE CLIENTES
	  *
	   FD  AR-CLIENTE
	       LABEL RECORD STANDARD.
	   01  RG-CLIENTE.
	       02 COD-CLI        PIC 9(5).
		   02 NOM-CLI        PIC 9(4)V9(2).
	  *
	  * DESCRIPCION DEL REGISTRO DE FACTURAS
	  *
	   FD  AR-FACTURA
	       LABEL RECORD STANDARD.
	   01  RG-FACTURA.
	       02 COD-FACTU      PIC 9(5).
		   02 IMP-FACTU      PIC 9(4)V9(2).
		   02 COD-CLI        PIC 9(4).
		   
	   PROCEDURE DIVISION.
	   INICIO-PROGRAMA.
	  *
	  * CREAR ARCHIVOS
	  *
	       OPEN OUTPUT AR-CLIENTE.
		   CLOSE AR-CLIENTE.
		   
		   OPEN AR-FACTURA.
		   CLOSE AR-FACTURA.
		   
		   STOP RUN.
		   
	  