      *
	  * PROGRAMA QUE CREA UN ARCHIVO SECUENCIAL DE
	  * ARTICULOS VACIO
	  *

123456 IDENTIFICATION DIVISION
       PROGRAM-ID. PE-ASI10.
	   REMARKS. ARCHIVOS / FICHEROS SECUENCIALES.
	   
	   ENVIRONMENT DIVISION
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
		   
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
      *
	  * DECLARACION DEL ARCHIVO
	  *
	       SELECT A-TIPOARTI ASSIGN TO DISK 'ATPAR.SEC'
		          ORGANIZATION LINE SEQUENTIAL
				  ACCESS SEQUENTIAL.
				  
	   DATA DIVISION.
	   FILE SECTION.
	   FD  A-TIPOARTI
	       LABEL RECORD STANDARD.
	   01  R-TIPOARTI.
	       02 COD-TPARTI     PIC 9(3).
		   02 DES-TPARTI     PIC X(20).
		   
	   PROCEDURE DIVISION.
	   INICIO-PROGRAMA.
	   
	       OPEN OUTPUT A-TIPOARTI.
		   CLOSE       A-TIPOARTI.
		   
		   STOP RUN.
		   
	   