    /*****************************/
    /*       COPYBOOK FOR        */
    /*  FERMYNO.DSFILES(DATAIN)  */
    /*****************************/
                                   
    /* DCL 1 FLINE,              */
          2 FCODE     CHAR (03),   
          2 FNAME     CHAR (20),   
          2 FADDRESS  CHAR (30),   
          2 FDOCUMENT CHAR (10),   
          2 FCITY     CHAR (15),   
          2 FREGION   CHAR (02);   
